test.k6/result-general.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: test.k6/test-general.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ General API: status is 200
     ✓ General API: response time < 500ms

     checks.........................: 100.00% 850 out of 850
     data_received..................: 4.1 MB  69 kB/s
     data_sent......................: 51 kB   855 B/s
     http_req_blocked...............: avg=25.19µs  min=3µs     med=11µs    max=977µs    p(90)=19µs     p(95)=49.59µs
     http_req_connecting............: avg=8.76µs   min=0s      med=0s      max=809µs    p(90)=0s       p(95)=0s
     http_req_duration..............: avg=89.48ms  min=34.54ms med=91.22ms max=115.96ms p(90)=105.36ms p(95)=109.52ms
       { expected_response:true }...: avg=89.48ms  min=34.54ms med=91.22ms max=115.96ms p(90)=105.36ms p(95)=109.52ms
     http_req_failed................: 0.00%   0 out of 425
     http_req_receiving.............: avg=395.68µs min=19µs    med=342µs   max=3.98ms   p(90)=717.2µs  p(95)=890µs
     http_req_sending...............: avg=40.42µs  min=6µs     med=31µs    max=1.03ms   p(90)=52.6µs   p(95)=75.59µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=89.04ms  min=34.33ms med=90.52ms max=115.5ms  p(90)=105.11ms p(95)=109.14ms
     http_reqs......................: 425     7.068305/s
     iteration_duration.............: avg=1.09s    min=1.03s   med=1.09s   max=1.11s    p(90)=1.1s     p(95)=1.11s
     iterations.....................: 425     7.068305/s
     vus............................: 1       min=1          max=10
     vus_max........................: 10      min=10         max=10


running (1m00.1s), 00/10 VUs, 425 complete and 0 interrupted iterations
default ✓ [======================================] 00/10 VUs  1m0s